In [1]:
import pandas as pd
import numpy as np

Let's define an empty dataframe.

In [2]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

The advantage of defining an empty dataframe sometimes is that we can pick data from somewhere as per our requirement and append in the dataframe one by one or to initialize an empty dataframe that can be appended dynamically later as per user input or other cases.

In [3]:
df1=pd.DataFrame([[1,3,2,4],[5,3,6,8],[11,5,4,33],[4,7,88,3]])
df1

    0  1   2   3
0   1  3   2   4
1   5  3   6   8
2  11  5   4  33
3   4  7  88   3

In [4]:
print(df1)

    0  1   2   3
0   1  3   2   4
1   5  3   6   8
2  11  5   4  33
3   4  7  88   3

In [5]:
df1.head()

    0  1   2   3
0   1  3   2   4
1   5  3   6   8
2  11  5   4  33
3   4  7  88   3

In [6]:
df1.head(2)

   0  1  2  3
0  1  3  2  4
1  5  3  6  8

In [8]:
df1.tail(3)

    0  1   2   3
1   5  3   6   8
2  11  5   4  33
3   4  7  88   3